---
kind: property
id: P:Autodesk.Revit.UI.Events.RibbonItemEventArgs.Application
source: html/32024786-5586-1a48-d40c-0c0d71d642d9.htm
---
# Autodesk.Revit.UI.Events.RibbonItemEventArgs.Application Property

The current UIApplication.

## Syntax (C#)
```csharp
public UIApplication Application { get; }
```